# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input('Введите число: '))
sum = 0
while n // 10 != 0:
    n1 = n % 10
    n = n // 10
    sum = sum + n1 
sum += n
print('Сумма цифр числа: ', sum)
