
# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так: A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков.
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка; 
# Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, 
# что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

# *Пример:*

# ноутбук
#    12

def task20v1():
    weight = {  0 : [' '], 1 : [ 'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т', 'A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R'],
    2 : [ 'Д', 'К', 'Л', 'М', 'П', 'У', 'D', 'G'], 3 : [ 'Б', 'Г', 'Ё', 'Ь', 'Я', 'B', 'C', 'M', 'P' ],
    4 : [ 'Й', 'Ы', 'F', 'H', 'V', 'W', 'Y' ], 5 : [ 'Ж', 'З', 'Х', 'Ц', 'Ч', 'K' ], 8 : [ 'Ш', 'Э', 'Ю', 'J', 'X' ], 
    10 : [ 'Ф', 'Щ', 'Ъ', 'Q', 'Z' ] }
        
    #weight_en = { 1 : [ 'A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R' ], 2 : [ 'D', 'G' ], 3 : [ 'B', 'C', 'M', 'P' ], 
    #4 : [ 'F', 'H', 'V', 'W', 'Y' ], 5 : [ 'K' ], 8 : [ 'J', 'X' ], 10 : [ 'Q', 'Z' ]}
    
    S = input('Введите слово или фразу на любом языке, чтобы посчитать его стоимость: ')
    s = S.upper()
    cost = 0
    val = list()
    for i in range(len(s)):
        for k, v in weight.items():
            for c in v:
                if s[i] == str(c):
                    cost += k
                    val.append(str(k))
    #sum = ' + '.join(val)
    #print(f'Стоимость введенного "{S}": {sum} = {cost}')
    print(f'Стоимость введенного "{S}" = {cost}')

#task20v1()   


def task20v2():

    weight_ru = { " " : 0, 'А' : 1, 'В' : 1, 'Е' : 1, 'И' : 1, 'Н' : 1, 'О' : 1, 'Р' : 1, 'С' : 1, 'Т' : 1, 'A' : 1, 'E' : 1,
    'I' : 1, 'O' : 1 , 'U' : 1, 'L' : 1, 'N' : 1, 'S' : 1, 'T' : 1, 'R' : 1, 'Д' : 2, 'К' : 2, 'Л' : 2, 'М' : 2, 'П' : 2,
    'У' : 2, 'D' : 2, 'G' : 2, 'Б' : 3, 'Г' : 3, 'Ё' : 3, 'Ь' : 3, 'Я' : 3, 'B' : 3, 'C' : 3, 'M' : 3, 'P' : 3, 'Й' : 4, 'Ы' : 4,
    'F' : 4, 'H' : 4, 'V' : 4, 'W' : 4, 'Y' : 4,  'Ж' : 5, 'З' : 5, 'Х' : 5, 'Ц' : 5, 'Ч' : 5 , 'K': 5, 'Ш' : 8, 'Э' : 8, 'Ю' : 8,
    'J' : 8, 'X' : 8, 'Ф' : 10, 'Щ' : 10, 'Ъ' : 10, 'Q' : 10, 'Z' : 10 }

    S = input('Введите слово или фразу, чтобы посчитать его стоимость: ')
    s = S.upper()
    cost = 0
    key_list = list(weight_ru.keys())
    val_list = list(weight_ru.values())
    val = list()
    for el in s:
        if el in key_list:
            pos = key_list.index(el)
            cost += val_list[pos]
            val.append(str(val_list[pos]))
    sum = ' + '.join(val)
    print(f'Стоимость введенного "{S}": {sum} = {cost}')
    #print(f'Стоимость введенного "{S}" = {cost}')

#task20v2()


def task20v3():
    weight = {  0 : ' ', 1 : 'АВЕИНОРСТAEIOULNSTR', 2 : 'ДКЛМПУDG', 
    3 : 'БГЁЬЯBCMP', 4 : 'ЙЫFHVWY', 5 : 'ЖЗХЦЧK', 8 : 'ШЭЮJX', 10 : 'ФЩЪQZ' }
        
    #weight_en = { 1 : [ 'A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R' ], 2 : [ 'D', 'G' ], 3 : [ 'B', 'C', 'M', 'P' ], 
    #4 : [ 'F', 'H', 'V', 'W', 'Y' ], 5 : [ 'K' ], 8 : [ 'J', 'X' ], 10 : [ 'Q', 'Z' ]}
    
    S = input('Введите слово или фразу на любом языке, чтобы посчитать его стоимость: ')
    s = S.upper()
    cost = 0
    val = list()
    for el in s:
        for k, v in weight.items():
            for c in v:
                if el in c:
                    cost += k
                    val.append(str(k))
    sum = ' + '.join(val)
    print(f'Стоимость введенного "{S}": {sum} = {cost}')
    #print(f'Стоимость введенного "{S}" = {cost}')

task20v3()   